# Aula 6 - Pandas 3

In [2]:
import numpy as np
import pandas as pd
from pandas import *

In [6]:
df = pd.read_csv('exemplo.csv', delimiter=';')
df

    Ano  Livros  Jogos  Cadernos
0  2015     111     53        32
1  2016     224    455        43
2  2017     434    567        65
3  2018     564   2333        77

In [8]:
df = pd.read_csv('exemplo.csv', delimiter=';', header=None)
df

      0       1      2         3
0   Ano  Livros  Jogos  Cadernos
1  2015     111     53        32
2  2016     224    455        43
3  2017     434    567        65
4  2018     564   2333        77

In [18]:
df = pd.read_csv('exemplo.csv', names=['Year', 'Books', 'Games', 'Notebooks'], delimiter=';', header=None, skiprows=1)
df

   Year  Books  Games  Notebooks
0  2015    111     53         32
1  2016    224    455         43
2  2017    434    567         65
3  2018    564   2333         77

In [21]:
df.describe().to_csv('new.csv')

## Lendo JSON

In [25]:
import json
data = json.load(open('exemplo.json'))
data

[{'cars': [{'model': 'Model X', 'name': 'Tesla'},
   {'model': 'F50', 'name': 'Ferrari'}],
  'info': {'owner': 'Edmund Kirsh'},
  'shortname': 'FL',
  'state': 'Florida'},
 {'cars': [{'model': '500', 'name': 'Fiat'}],
  'info': {'owner': 'Antonio Valdespino'},
  'shortname': 'OH',
  'state': 'Ohio'}]

### Via Pandas

In [28]:
# Leitura de json para DataFrame
df_json = pd.read_json('exemplo.json')
df_json

,cars,info,shortname,state
0,"[{'name': 'Tesla', 'model': 'Model X'}, {'name...",{'owner': 'Edmund Kirsh'},FL,Florida
1,"[{'name': 'Fiat', 'model': '500'}]",{'owner': 'Antonio Valdespino'},OH,Ohio

In [32]:
from pandas.io.json import json_normalize
json_normalize(data, "cars", ['state', 'shortname', ['info', 'owner']])

     model     name    state shortname          info.owner
0  Model X    Tesla  Florida        FL        Edmund Kirsh
1      F50  Ferrari  Florida        FL        Edmund Kirsh
2      500     Fiat     Ohio        OH  Antonio Valdespino

In [34]:
dicionario = {"Teste": "Teste 2"}

In [36]:
# Converte a saida para um tipo JSON
json.dumps(dicionario)

'{"Teste": "Teste 2"}'

In [38]:
# Leitura de uma string para formato JSON
json.loads('{"Teste": "Teste 2"}')

{'Teste': 'Teste 2'}

### Excel

In [47]:
df_excel = pd.read_excel('exemplo.xlsx')

In [59]:
df_excel[11:12]['Filme'] = 'Captain America 3'

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

### Merging

### Desafio 1
Crie um novo dataframe correlacionando o ID das tabelas CSV “pimas-data-norm2.csv” com “pimas-data-city.csv” na pasta data (Github). Ao final, exportar o resultado para “pima-data-norm-city.csv”.

In [136]:
df_1 = read_csv('pima-data-norm-2.csv', delimiter=',')
df_2 = read_csv('pima-data-city.csv', delimiter=';')

In [74]:
pd.merge(df_1, df_2, on=["id", "id"], suffixes=("_norm-2", "_city")).to_csv('pima-data-norm-city.csv', index=False)

### Stack

In [77]:
data_frame_1 = DataFrame(np.arange(8).reshape(2,4), 
                         index=pd.Index(["SP","RJ"], 
                                        name="Cidade"), 
                         columns=pd.Index(["Casa", "Prédio", "Mercado", "Oficina"],
                                          name="Estabelecimentos"))
data_frame_1

Estabelecimentos  Casa  Prédio  Mercado  Oficina
Cidade
SP                   0       1        2        3
RJ                   4       5        6        7

In [79]:
data_frame_1.stack()

Cidade  Estabelecimentos
SP      Casa                0
        Prédio              1
        Mercado             2
        Oficina             3
RJ      Casa                4
        Prédio              5
        Mercado             6
        Oficina             7
dtype: int32

In [82]:
df_stack = data_frame_1.stack()

In [84]:
df_stack.get("RJ").get("Casa")

4

In [86]:
df_stack.unstack()

Estabelecimentos  Casa  Prédio  Mercado  Oficina
Cidade
SP                   0       1        2        3
RJ                   4       5        6        7

In [89]:
df_stack.unstack("Cidade")

Cidade            SP  RJ
Estabelecimentos
Casa               0   4
Prédio             1   5
Mercado            2   6
Oficina            3   7

### Desafio 2
Utilizando o dataframe ajustado da challenge 1, padronize seus dados para exibir valores numéricos ao invés de dados categorizados no atributo de classe. Exemplo, ao invés de true ou false, utilizar 1 ou 0.

In [133]:
df_1.head(5)

,id,num_preg,glucose_conc,diastolic_bp,insulin,bmi,diab_pred,age,skin,diabetes
0,0,6,148.0,72.000000,0.0,33.6,0.627,50,1.379000,True
1,1,1,85.0,66.000000,0.0,26.6,0.351,31,1.142600,False
2,2,8,183.0,69.112125,0.0,23.3,0.672,32,0.809136,True
3,3,1,89.0,66.000000,94.0,28.1,0.167,21,0.906200,False
4,4,0,137.0,40.000000,168.0,43.1,2.288,33,1.379000,True

In [98]:
clean = {True: 1, False: 0}

In [137]:
df_1["diabetes"] = df_1["diabetes"].map(clean)

### Agregação

In [105]:
data_frame_1 = DataFrame({"Coluna 1": ["A", "A", "B", "B", "C"], 
                          "Coluna 2": [1, 2, 1, 2, 1], 
                          "Coluna 3": np.random.randn(5), 
                          "Coluna 4": np.random.randn(5)})
data_frame_1

  Coluna 1  Coluna 2  Coluna 3  Coluna 4
0        A         1 -0.261779 -0.427246
1        A         2 -0.160865 -1.893191
2        B         1 -0.008563  0.467024
3        B         2  1.758835 -0.093030
4        C         1  0.886854  0.672079

In [107]:
group_1 = data_frame_1["Coluna 3"].groupby(data_frame_1["Coluna 1"])
group_1.mean()

Coluna 1
A   -0.211322
B    0.875136
C    0.886854
Name: Coluna 3, dtype: float64

In [108]:
group_1.max()

Coluna 1
A   -0.160865
B    1.758835
C    0.886854
Name: Coluna 3, dtype: float64

In [109]:
data_frame_1.groupby(["Coluna 1"]).mean()

          Coluna 2  Coluna 3  Coluna 4
Coluna 1
A              1.5 -0.211322 -1.160219
B              1.5  0.875136  0.186997
C              1.0  0.886854  0.672079

In [111]:
group_dict = dict(list(data_frame_1.groupby("Coluna 1")))
group_dict

{'A':   Coluna 1  Coluna 2  Coluna 3  Coluna 4
 0        A         1 -0.261779 -0.427246
 1        A         2 -0.160865 -1.893191,
 'B':   Coluna 1  Coluna 2  Coluna 3  Coluna 4
 2        B         1 -0.008563  0.467024
 3        B         2  1.758835 -0.093030,
 'C':   Coluna 1  Coluna 2  Coluna 3  Coluna 4
 4        C         1  0.886854  0.672079}

In [113]:
group_dict["A"]

  Coluna 1  Coluna 2  Coluna 3  Coluna 4
0        A         1 -0.261779 -0.427246
1        A         2 -0.160865 -1.893191

In [117]:
coluna_2_group = data_frame_1.groupby(["Coluna 1", "Coluna 2"])[["Coluna 4"]]
coluna_2_group.mean()

                   Coluna 4
Coluna 1 Coluna 2
A        1        -0.427246
         2        -1.893191
B        1         0.467024
         2        -0.093030
C        1         0.672079

In [120]:
def max_to_min(arr):
    return arr.max() - arr.min()

In [121]:
group_2 = data_frame_1.groupby(["Coluna 1"])

In [122]:
group_2.agg(max_to_min)

          Coluna 2  Coluna 3  Coluna 4
Coluna 1
A                1  0.100913  1.465946
B                1  1.767398  0.560054
C                0  0.000000  0.000000

In [124]:
group_2.agg("mean")

          Coluna 2  Coluna 3  Coluna 4
Coluna 1
A              1.5 -0.211322 -1.160219
B              1.5  0.875136  0.186997
C              1.0  0.886854  0.672079

### Tabulação Cruzada

In [126]:
data_frame_1 = pd.read_excel("exemplo_crosstabulation.xlsx")
data_frame_1

   Sujeito    Tipo  Condição
0        1   Jovem  Demência
1        2  Adulto  Saudável
2        3  Adulto  Demência
3        4   Idoso  Saudável
4        5   Idoso  Demência
5        6   Idoso  Saudável
6        7  Adulto  Saudável
7        8   Jovem  Saudável
8        9   Jovem  Demência
9       10   Idoso  Demência

In [128]:
pd.crosstab(data_frame_1.Tipo, data_frame_1.Condição, margins=True)

Condição  Demência  Saudável  All
Tipo
Adulto           1         2    3
Idoso            2         2    4
Jovem            2         1    3
All              5         5   10

In [130]:
pd.crosstab(data_frame_1.Tipo, data_frame_1.Condição, margins=False)

Condição  Demência  Saudável
Tipo
Adulto           1         2
Idoso            2         2
Jovem            2         1

#### Desafio 3
Utilizando o dataframe ajustado da challenge anterior, exiba as seguintes informações:  
• Soma de diabetes para idades entre 20 e 50 anos;  
• Soma de gravidezes para idades até 30 anos;  
• Soma de diabetes por estado;  
• Média da pressão diastólica por cidade

In [139]:
df_1.groupby(["Coluna 1"])

,id,num_preg,glucose_conc,diastolic_bp,insulin,bmi,diab_pred,age,skin,diabetes
0,0,6,148.0,72.000000,0.0,33.6,0.627,50,1.379000,1
1,1,1,85.0,66.000000,0.0,26.6,0.351,31,1.142600,0
2,2,8,183.0,69.112125,0.0,23.3,0.672,32,0.809136,1
3,3,1,89.0,66.000000,94.0,28.1,0.167,21,0.906200,0
4,4,0,137.0,40.000000,168.0,43.1,2.288,33,1.379000,1